"""
字典的基本格式：【变量】 = {【键】 : 【值】,
                       【键】 : 【值】,      键不可变，值可变
                             ……      }     字典可变
元组的基本格式：tuple = ("" , "")     元组不可变
"""

# 一个关于通讯录的案例
user_information = {"欧阳": "14788889886",
                    "纳兰": "13510100101",
                    "诸葛": "13920223124",
# 使用元组、加入年龄(以作区分)写入名字重复的人的号码
                    ("嘉豪", 21): 17000000001,
                    ("嘉豪", 22): 17000000002}

# 获取某个人(键)的号码(值)   ps.不要写等号！！
print(user_information["欧阳"])

# 使用in语法与调用布尔值查看通讯录(字典)是否有某人(键)的号码(值)
print("欧阳" in user_information)

# 使用len函数查看通讯录中(字典)有多少位联系人(多少对对键与值)
print(len(user_information))

# del函数通过键删除字典中对应的值
del user_information["纳兰"]

# 往字典里添加内容
user_information["墨兰"] = "18699996666"
